{
    "AWS Practice Test": {
        "Your application requirements for CPU and RAM change rapidly these days. \nWhich service can be used to dynamically adjust those resources based on demand?": "Auto Scaling",
        "You have 2 accounts in AWS. One for Dev and the other for QA. All are part of consolidated billing.\nThe master account has purchased 4 reserved instances. The Dev department is currently using 2 reserved instances.\nThe QA team is planning on using 3 instances, which are of the same instance type.\nWhat is the pricing tier of the instances that can be used by the QA Team?": "Two Reserved and 1 on-demand",
        "Which of the following given options is not a feature of an edge location?": "Distributes load across multiple resources",
        "Where can AWS customers find their historical billing information?": "Billing and Cost Management console",
        "The owner of an E-Commerce application notices that the computing workloads vary heavily from time to time.\nWhat makes AWS more economical than traditional data centers for this type of application?": "AWS allows customers to launch and terminate EC2 instances based on demand.",
        "Which of the following is a cloud computing deployment model that connects infrastructure and applications between cloud-based resources and existing resources not located in the cloud?": "Hybrid",
        "Which of the given options correctly indicates a specific benefit of an Enterprise Support plan?": "Included Technical Account Manager (TAM)",
        "A company has a web application that is running on a number of Amazon EC2 instances.\nThe app is approaching 100% CPU Utilization on one of them.\nHow can they reduce the load on that instance?": "Create a load balancer, and register the Amazon EC2 instances with it.\n",
        "If you are using an On-Demand EC2 Instance, how are you being charged for it?": "You are charged per second, based on an hourly rate, and there are no termination fees.",
        "Which of the following AWS services would you use to register a new domain name in the AWS Platform?": "Amazon Route 53",
        "Let us suppose Peter is facing problems with the current contact center.\nWhich of the following service provides a cloud-based contact centre that can deliver a better service for the customers?": "Amazon Connect",
        "Your company's Management is getting very nervous about managing governance, compliance, and risk auditing in AWS.\nWhat service should you enable and inform Management about?": "CloudTrail",
        "What is a key benefit of accessing AWS Cloud services through an API?": "Ability to manage AWS services programmatically",
        "How long does the AWS free usage tier for EC2 last for?": "12 Months upon signup",
        "Which AWS network feature can establish a private network connection between AWS and your datacenter?": "AWS Direct Connect",
        "A company is planning to develop an application consisting of hundreds of microservices. They decide to host the application on the AWS Cloud.\nSince there are a large number of services produced by the application, it needs a powerful tool for analysis and debugging.\nWhich of the following services can best meet this requirement?": "AWS X-Ray",
        "Which of the following services gives you access to all AWS auditor-issued reports?": "AWS Artifact",
        "What best describes penetration testing?": "Testing your own network/application for vulnerabilities",
        "Which of the following Cloud Computing models assists in removing the need to manage operating systems on its own by an organization?": "PaaS",
        "Which of the following services allows you to run containerized applications on a cluster of EC2 instances?": "Amazon Elastic Container Service.",
        "What statement best describes the purpose of having multiple Availability Zones in each AWS region?": "Multiple Availability Zones allow for duplicate and redundant compute and storage.",
        "You need to improve the security of your AWS service APIs against unauthorized access.\nWhat activity best achieves this goal?": "Apply Multi-Factor Authentication (MFA)",
        "A company has developed an eCommerce web application and the application needs an uptime of at least 99.5%.\nWhich of the following deployment strategies should they use?": "Deploying the application across multiple Regions",
        "An organization has decided to reserve EC2 compute capacity for three years to get more discounts.\nTheir application workloads are likely to change during this time period.\nWhat is the EC2 Reserved Instance (RI) type that allows them to change the attributes of the RI whenever they need?": "Convertible RIs",
        "You are designing a web application that will be hosted in the AWS Cloud.\nWhich of the following should you pay attention to in order to reduce interdependencies so that the failure of one component does not impact other components?": "Decoupling",
        "AWS provides excellent cloud-based disaster recovery services utilizing their multiple _____________ .": "Regions",
        "Which of the following AWS service will simplify the Migration of a database to AWS?": "AWS Database Migration Service (AWS DMS)",
        "A company has decided to migrate to AWS.\nWhat design principles should they consider to facilitate good design in the cloud?": "Automate to make architectural experimentation easier.",
        "AWS provides the ability to create backups of any Amazon EC2 volume into what is known as a/an:": "snapshot",
        "Which of the following services can be used to process images uploaded to S3?": "AWS Lambda",
        "What are Edge locations used for?": "They are used by CloudFront for caching content",
        "Which statement best describes what AWS is?": "AWS is a cloud services provider.",
        "Which of the following services can help protect your web applications from SQL injection and other vulnerabilities in your application code?": "AWS WAF",
        "Which of the following AWS services use Edge Locations for the purpose of caching content?": "AWS CloudFront",
        "For mobile applications, which of the following allows client devices access to AWS resources?": "Amazon Cognito",
        "A company needs to track resource changes using the API call history.\nWhich AWS service can help the company achieve this goal?": "AWS CloudTrail",
        "Which of the following AWS security features is associated with a subnet in a VPC and functions to filter incoming traffic requests?": "NACL",
        "Which database should you use if your application requires joins or complex transactions?": "Amazon RDS",
        "How does AWS notify customers about the latest security and privacy events within AWS services?": "Using Security Bulletins",
        "Which of the given options is an example of the architectural benefit of moving to the cloud?": "Elasticity",
        "You have bought 4 Amazon EC2 reserved instances for a 1 year term.\nAfter 7 months you decide to sell 2 of your instances on the Amazon EC2 Reserved Instance Marketplace.\nWhich of the following is true regarding this scenario?": "You can set only the upfront price for your reserved instances.",
        "You noticed that several critical Amazon Elastic Compute Cloud (Amazon EC2) instances have been terminated.\nWhich of the following AWS services would help you determine who took this action?": "AWS CloudTrail",
        "Let us suppose your web application generates digital policy files for verifying users. Such that once the files are verified, they may not be required in the future unless there are some compliance issues.\nWhich of the following options would you suggest to save them in a cost-effective manner?": "AWS Glacier",
        "The concept of elasticity is most closely associated with which of the following?": "Auto Scaling",
        "Which of the following AWS support plans gives you access to a “Well-Architected Review” delivered by AWS Solution Architects?": "Enterprise",
        "There are performance issues with your under-development application, being built using microservices architecture.\nWhich of the following AWS services would help you analyze these issues?": "X-Ray",
        "Which of the following AWS offering allows customers to find, buy, and immediately start using software solutions in their AWS environment?": "AWS Marketplace",
        "A company has a DevOps team in its organizational structure. They are looking forward to moving to the AWS Cloud.\nThey are wondering if there is an AWS service that can help them manage infrastructure as code.\nWhich of the following would you suggest for them?": "AWS CloudFormation",
        "A company is deploying a new two-tier web application in AWS.\nWhere should the most frequently accessed data be stored so that the application’s response time is optimal?": "Amazon ElastiCache",
        "Which of the given options is a part of the AWS's responsibility, with reference to the AWS shared responsibility model?": "Infrastructure that runs all of the services offered",
        "You work for a hospital that needs to store patients’ medical records for a minimum of 10 years.\nMost of these records will never be accessed but must be made available upon request (within a few hours).\nWhat is the most cost-effective storage option?": "Amazon Glacier",
        "Your application requirements for CPU and RAM change rapidly these days.\nWhich service can be used to dynamically adjust those resources based on demand?": "Auto Scaling",
        "Which of the following options is suitable for connecting to Amazon EC2 instances?": "Key pairs",
        "Which statement best describes the concept of an AWS region?": "It is a geographical area divided into Availability Zones",
        "Miller is working with a large data set, and he needs to import it into a relational database service.\nWhat AWS service will meet his needs?": "RDS",
        "You have been tasked with auditing the security of your VPC. As part of this process, you need to start by analyzing what traffic is allowed to and from various EC2 instances.\nWhat two parts of the VPC do you need to check to accomplish this task?": "Security Groups and NACLs",
        "Who can help your organization achieve their desired business outcomes with AWS?": "AWS Professional Services",
        "Engineers are wasting a lot of time and effort when installing and managing batch computing software in traditional data centers.\nWhich of the following AWS services allows them to easily run hundreds of thousands of batch computing jobs?": "AWS Batch",
        "Which AWS support plan would help provide general guidance when you request Architecture Support?": "Developer",
        "A company is using EC2 Instances to run their e-commerce site on the AWS platform.\nA busy e-commerce site could lose thousands of dollars every minute it is unavailable.\nWhich of the principles below should they adopt to ensure that even if some of their EC2 Instances stop working, their site will continue to run as usual?": "Use a fault tolerant system",
        "What does the term “Economies of scale” mean?": "It means that AWS will continuously lower costs as it grows.",
        "Which of the following is an advantage of decoupling an application?": "Reduce inter-dependencies so failures do not impact other components of the application.",
        "What technology enables compute capacity to adjust as loads change?": "Auto Scaling",
        "Which of the following should an IAM user provide to interact with AWS services using the AWS CLI?": "Access keys",
        "Where can a customer locate information of the prohibited actions on AWS infrastructure?": "AWS Acceptable Use Policy",
        "What service helps you to aggregate log files from your EC2 instances?": "CloudWatch Logs",
        "Which of the following services allows you to manage your agreements with AWS?": "AWS Artifact",
        "What is the key difference between an availability zone and an edge location?": "An availability zone exists within a region, whereas edge locations deliver cached content from the closest location to the user to reduce latency",
        "You are planning to host your education website on AWS. Most of your video courses will be streamed all around the world.\nWhich of the following AWS services would help you achieve high transfer speeds?": "AWS CloudFront",
        "What is the document that provides a formal statement of one or more permissions?": "Policy",
        "Once again your customers are concerned about the security of their sensitive data, and now ask you, ”What happens to old storage devices on AWS?”\nWhat would be the best answer to this Question?": "AWS uses the techniques detailed in DoD 5220.22-M to destroy data as part of the decommissioning process",
        "Which networking service enables one to create a virtual network within AWS?": "Amazon Virtual Private Cloud (Amazon VPC)",
        "An organization has an on-premises application that serves users from all around the world.\nIf instead the application was deployed in AWS, what is the AWS characteristic that could help reduce latency to their users?": "Global reach",
        "Which statement is true in relation to security?": "AWS cannot access users’ data",
        "Which of the following can be used to increase the fault tolerance of an application?": "Deploying resources across multiple Availability Zones",
        "You are developing a document generator application that helps users create and modify PDFs.\nWhich of the following allows you to publish your application?": "AWS Serverless Application Repository",
        "When using on-demand instances in AWS, which of the following is a false statement about its cost?": "You have to pay the termination fees if you terminate the instance",
        "There are a lot of advantages in changing your traditional hosting provider to AWS. One of these advantages is the ability to save costs.\nWhat does Amazon EC2 provide to save you costs?": "You only pay for what you use",
        "What does the AWS Storage Gateway provide?": "It allows one to integrate on premises IT environments with Cloud Storage",
        "Why is AWS considered more economical than traditional data centers for handling applications with varying compute workloads?": "Amazon EC2 instances can be launched on-demand when needed.",
        "Which of the following services can be used to monitor the HTTP and HTTPS requests that are forwarded to Amazon CloudFront?": "AWS WAF",
        "Which of the following allows you to carve out a portion of the AWS Cloud?": "AWS VPC",
        "What is the purpose of Edge locations?": "They are used by CloudFront for caching content",
        "In order to keep your data safe, you need to take a backup of your database regularly.\nWhat is the most cost-effective storage option that provides immediate retrieval of your backups?": "Amazon S3",
        "What should you do in order to keep the data on EBS volumes safe?": "Create EBS snapshots",
        "Before moving and/or storing an object in AWS Glacier, what considerations should be taken into account regarding the data you want to store?": "Be aware that it takes at least few minutes to retrieve the data once stored on Glacier",
        "Which of the following is NOT a factor when estimating the cost of Amazon EC2?": "Number of security groups",
        "What does Amazon SES stand for ?": "Simple Email Service",
        "Which of the following is an AWS-managed database service that provides processing power up to five times faster than a traditional MySQL database?": "Aurora",
        "One of the most important AWS best practices to follow is the cloud architecture principle of elasticity.\nHow does following this principle improve your architecture’s design?": "By automatically provisioning the required AWS resources based on changes in demand",
        "What is the easiest way to launch and manage a virtual private server in AWS?": "Using Amazon Lightsail",
        "What is the minimum level of AWS support that provides 24x7 access to technical support engineers via phone?": "Business",
        "Which service can be used to route end users to the nearest datacenter to reduce latency?": "Amazon Route 53",
        "Which of the following can be used to automate the management of multiple AWS services through scripts?": "AWS CLI",
        "Your company has a microservices data store that requires access to a NoSQL database.\nYour IT department has no desire to manage the NoSQL servers.\nWhich Amazon service provides a fully-managed and highly available NoSQL service?": "DynamoDB",
        "Which service can a non AWS customer use to estimate the cost of migrating to the AWS cloud?": "AWS TCO Calculator",
        "You work for a large consulting firm that has just hired a junior consultant named Nina, who will be working on a large AWS project. She will be working remotely. You create a new IAM user for her in your company’s AWS account.\nOn Nina’s first day, you ask her to make a change to a CloudWatch alarm in an Auto Scaling group.\nNina reports back that she does not have access to CloudWatch or auto scaling in the AWS console.\nWhat might be the reason for this?": "There is a non-explicit deny to all new users",
        "What does the AWS Snowball provide?": "Secure transfer of large amounts of data into and out of the AWS Cloud",
        "You have multiple standalone accounts and you want to decrease your AWS charges.\nWhat should you do ?": "Add the accounts to an organization and use Consolidated Billing",
        "Which of the following strategies help analyze costs in AWS?": "Using tags to group resources",
        "Which Amazon EC2 Reserved Instance type enables you to match your capacity reservation to predictable recurring dates and times?": "Scheduled RI",
        "Derek is running a web application and is noticing that he is paying for way more server capacity than required.\nWhat AWS feature should Derek set up and configure to ensure that his application is automatically adding/removing server capacity to closely match the required demand?": "AWS Autoscaling",
        "An Amazon EC2 instance running the Amazon Linux 2 AMI is billed in what increment?": "Per second",
        "You manage a blog on AWS that has different stages such as development, testing, and production.\nHow can you create a custom console in each stage to view and manage your resources easily?": "AWS Resource Groups",
        "Which service analyzes EC2 Instances against pre-defined security templates to check for vulnerabilities?": "AWS Inspector",
        "Which of the following is true regarding Elastic IP addresses?": "You can have one EIP free of charge",
        "A company has a distributed application that periodically processes large volumes of data across multiple Amazon EC2 Instances.\nThe application is designed to recover gracefully from Amazon EC2 instance failures. There is a requirement to accomplish this task in the most cost-effective way.\nWhich one of the following types of instance would be most appropriate choice to use?": "Spot Instances",
        "Which of the following support plans include the AWS Support Concierge Service?": "Enterprise",
        "What can you do to best make your application on AWS highly available?": "Deploy to at least two Availability Zones",
        "Which of the following services can be used to secure network communications and establish the identity of websites over the Internet?": "AWS Certificate Manager",
        "An organization runs many systems and uses many AWS products.\nWhich of the following services allow them to control how each developer interacts with these products?": "AWS Identity and Access Management",
        "What of the given AWS tools offer real time assistance to help you provision your resources following best practices in the areas of cost optimization, performance, security and fault tolerance?": "AWS Trusted Advisor",
        "A company currently uses VM Templates to spin up virtual machines on their on-premise infrastructure.\nWhich of the following can be used in a similar way to spin up EC2 instances on the AWS Cloud?": "Amazon Machine Images",
        "You need to migrate a large number of on-premises workloads to AWS.\nWhich of the following is the fastest way to achieve your goal?": "Use the AWS Server Migration Service",
        "What are AWS’ recommendations regarding root access keys?": "Delete them",
        "What is the feature provided by AWS that enables fast and secure transfer of files over long distances between your client and your Amazon S3 bucket?": "S3 Transfer Acceleration",
        "____________ is the technology that allows compute capacity to adjust as loads change.": "Auto Scaling",
        "Which of the following is not a supported database engine in the AWS RDS service?": "DB2",
        "You are sure that your application deployed in AWS needs frequent updates for the next 6 months.\nWhich of the following services would allow you to make these updates easily, retaining the ability to change the AWS resources powering the application any time?": "AWS Elastic Beanstalk",
        "When giving permission to users via the AWS Identity and Access Management tool, which of the following principles should be applied when granting permissions?": "Principle of least privilege",
        "Which of the following statements is correct regarding Availability Zones?": "An Availability Zone is a distinct location within a region that is insulated from failures in other Availability Zones",
        "Which of the following can be used to call AWS services from different programming languages?": "AWS SDK",
        "You have multiple accounts in AWS. Which of the following can be used to reduce costs?": "Consolidated billing",
        "Which of the following AWS services uses Puppet to automate how EC2 instances are configured?": "AWS OpsWorks",
        "Which AWS service uses Edge Locations to cache content?": "AWS CloudFront",
        "Which AWS service must you use if you want to configure an AWS billing alarm?": "CloudWatch",
        "What can you use as a common file system for multiple EC2 instances?": "Amazon Elastic File System",
        "A company is currently using the Enterprise Support plan. They want quick and efficient guidance with their billing and account inquiries.\nWhich of the following included services could assist them?": "AWS Support Concierge",
        "Which of the following needs a username and password to access AWS resources?": "AWS Management Console",
        "Which of the following services allows you to install and run your custom relational database software?": "Amazon EC2",
        "A company needs to host a big data application on AWS.\nWhich of the following AWS Storage services would they choose to automatically get high throughput to multiple compute nodes?": "Amazon Elastic File System",
        "Which of the following can be used to process a large number of binary files while following the AWS well-architected design principles?": "Use a number of parallel EC2 instances",
        "You need to run a number of Amazon EC2 Instances that are physically isolated at the host hardware level from instances that belong to any other\nAWS account. How can you meet this requirement in a cost effective way?": "Use EC2 Dedicated Instances",
        "Which DynamoDB feature can be used to reduce the latency of requests to a database from milliseconds to microseconds?": "DAX",
        "In order to send alerts based on Amazon CloudWatch alarms, you are required to choose the service that a user would use.\nWhich of the following service would you choose?": "Amazon SNS",
        "Which of the following is NOT a benefit of using Amazon VPC?": "Amazon VPC allows you to control user interactions with various AWS resources"
    }
}